CPE3B-ersando-aarongabriel/AgapAI-Backend/docs/esp32_capture_window_firmware.ino
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <DHT.h>
#include <SPI.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <time.h>
#include <math.h>
#include <driver/i2s.h>

#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#endif

#ifndef ESP_ARDUINO_VERSION_MAJOR
#define ESP_ARDUINO_VERSION_MAJOR 2
#endif

// =========================
// User Config
// =========================
const char* WIFI_SSID = "TendahanNiHosebo";
const char* WIFI_PASSWORD = "ussnimitz1825!";

const char* API_BASE = "https://agapai-backend.onrender.com/";
const char* DEVICE_ID = "esp32-dev-001";
const char* FW_VERSION = "esp32-streaming-v1";

// If true, read real presence from LD2410 OUT pin.
// If false, infer presence from mic activity.
const bool USE_REAL_LD2410_OUT = true;

// =========================
// Hardware Pins (unchanged)
// =========================
#define DHTPIN 4
#define DHTTYPE DHT22

#define BUTTON_PIN 14
#define LD2410_OUT_PIN 27

// OLED SPI (6-pin module, no CS)
#define OLED_SCLK 18
#define OLED_MOSI 23
#define OLED_DC 16
#define OLED_RST 17
#define OLED_CS -1

#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 64

// INMP441 I2S
#define I2S_PORT I2S_NUM_0
#define I2S_WS 25
#define I2S_SCK 26
#define I2S_SD 33

// =========================
// Timing / Runtime
// =========================
const uint32_t SAMPLE_INTERVAL_MS = 1200;
const uint32_t WIFI_CONNECT_TIMEOUT_MS = 25000;
const uint32_t WIFI_RETRY_INTERVAL_MS = 4000;
const uint32_t BUTTON_DEBOUNCE_MS = 40;
const uint32_t HEARTBEAT_MS = 2000;
const uint32_t SNORE_THRESHOLD = 45;

const uint16_t HTTP_CONNECT_TIMEOUT_MS = 5000;
const uint16_t HTTP_TIMEOUT_MS = 8000;
const bool SERIAL_LOGS = true;

// Mic normalization targets: convert tiny linear PCM magnitudes into a stable 0-100 scale.
const float MIC_DB_MIN = -75.0f;
const float MIC_DB_MAX = -20.0f;
const uint8_t MIC_SILENT_REINIT_AFTER = 14;

enum DeviceState {
  STATE_IDLE,
  STATE_CAPTURING,
  STATE_SUBMITTING,
  STATE_RESULT,
  STATE_ERROR
};

struct SensorSample {
  uint64_t epoch_ms;
  float mic_raw;
  float mic_rms;
  float mic_peak;
  float temperature;
  float humidity;
  float breathing_rate;
  float movement_level;
  bool presence_detected;
};

struct RollingStats {
  uint32_t sample_count;
  double sum_mic_raw;
  double sum_mic_rms;
  float max_mic_peak;
  uint32_t snore_event_count;
  double sum_breathing_rate;
  double sum_temperature;
  double sum_humidity;
};

DHT dht(DHTPIN, DHTTYPE);
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &SPI, OLED_DC, OLED_RST, OLED_CS);

DeviceState currentState = STATE_IDLE;
bool oledReady = false;
String currentSessionId = "";
RollingStats stats = {};

// Keep a tiny retry queue so temporary network drops do not lose samples.
const uint8_t PENDING_QUEUE_CAPACITY = 20;
SensorSample pendingQueue[PENDING_QUEUE_CAPACITY];
uint8_t pendingCount = 0;

// Auto-select active I2S channel (0=left, 1=right) to avoid silent-channel setups.
int activeMicChannel = -1;
int activeMicDecode = -1;
uint8_t micSilentStreak = 0;

float lastValidTemp = 25.0f;
float lastValidHum = 50.0f;
uint32_t lastDhtWarnMs = 0;

String latestRecommendation = "";
String latestBreathingLine = "";

bool buttonLastRawState = HIGH;
bool buttonStableState = HIGH;
uint32_t lastDebounceMs = 0;
uint32_t lastButtonPollLogMs = 0;

uint32_t lastSampleMs = 0;
uint32_t lastHeartbeatMs = 0;
uint32_t lastWiFiAttemptMs = 0;

// =========================
// Utility
// =========================
const char* stateName(DeviceState s) {
  switch (s) {
    case STATE_IDLE: return "IDLE";
    case STATE_CAPTURING: return "CAPTURING";
    case STATE_SUBMITTING: return "SUBMITTING";
    case STATE_RESULT: return "RESULT";
    case STATE_ERROR: return "ERROR";
    default: return "UNKNOWN";
  }
}

void logLine(const String& msg) {
  if (SERIAL_LOGS) {
    Serial.println(msg);
  }
}

void setState(DeviceState next) {
  if (currentState != next) {
    logLine(String("[STATE] ") + stateName(currentState) + " -> " + stateName(next));
  }
  currentState = next;
}

String baseUrlNormalized() {
  String b = String(API_BASE);
  while (b.endsWith("/")) {
    b.remove(b.length() - 1);
  }
  return b;
}

String endpointStart() {
  return baseUrlNormalized() + "/api/session/start";
}

String endpointChunk() {
  return baseUrlNormalized() + "/api/session/chunk";
}

String endpointEnd() {
  return baseUrlNormalized() + "/api/session/end";
}

uint64_t nowEpochMs() {
  struct timeval tv;
  gettimeofday(&tv, nullptr);
  return (uint64_t)tv.tv_sec * 1000ULL + (uint64_t)tv.tv_usec / 1000ULL;
}

String iso8601FromEpochMs(uint64_t epochMs) {
  time_t sec = (time_t)(epochMs / 1000ULL);
  struct tm tmUtc;
#if defined(ESP32)
  gmtime_r(&sec, &tmUtc);
#else
  tmUtc = *gmtime(&sec);
#endif

  char buf[32];
  snprintf(
    buf,
    sizeof(buf),
    "%04d-%02d-%02dT%02d:%02d:%02d.000Z",
    tmUtc.tm_year + 1900,
    tmUtc.tm_mon + 1,
    tmUtc.tm_mday,
    tmUtc.tm_hour,
    tmUtc.tm_min,
    tmUtc.tm_sec
  );
  return String(buf);
}

String clipText(const String& s, size_t maxLen = 21) {
  if (s.length() <= maxLen) return s;
  return s.substring(0, maxLen);
}

// =========================
// OLED
// =========================
void drawOled(const String& l1, const String& l2 = "", const String& l3 = "") {
  if (!oledReady) {
    logLine(String("[OLED] ") + l1 + (l2.length() ? " | " + l2 : "") + (l3.length() ? " | " + l3 : ""));
    return;
  }

  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(0, 0);
  display.println(l1);
  if (l2.length()) display.println(l2);
  if (l3.length()) display.println(l3);
  display.display();
}

void initOled() {
  SPI.begin(OLED_SCLK, -1, OLED_MOSI, -1);
  if (!display.begin(SSD1306_SWITCHCAPVCC)) {
    oledReady = false;
    logLine("[OLED] init failed");
    return;
  }
  oledReady = true;
  logLine("[OLED] SPI OLED ready");
  drawOled("AGAPAI", "SPI OLED ready");
}

// =========================
// WiFi / NTP
// =========================
bool connectWiFiBlocking(uint32_t timeoutMs = WIFI_CONNECT_TIMEOUT_MS) {
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  logLine(String("[WIFI] Connecting to ") + WIFI_SSID);
  uint32_t start = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - start) < timeoutMs) {
    delay(300);
  }

  if (WiFi.status() == WL_CONNECTED) {
    logLine(String("[WIFI] Connected IP=") + WiFi.localIP().toString() + " RSSI=" + String(WiFi.RSSI()));
    drawOled("WiFi connected", WiFi.localIP().toString());
    return true;
  }

  logLine("[WIFI] Connect timeout");
  drawOled("WiFi failed");
  return false;
}

