CPE3B-ersando-aarongabriel/AgapAI-Backend/docs/esp32_capture_window_firmware.ino
void ensureWiFiConnected() {
  if (WiFi.status() == WL_CONNECTED) return;

  uint32_t nowMs = millis();
  if ((nowMs - lastWiFiAttemptMs) < WIFI_RETRY_INTERVAL_MS) return;
  lastWiFiAttemptMs = nowMs;

  logLine("[WIFI] Reconnecting...");
  WiFi.disconnect();
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
}

void syncNtpTime() {
  if (WiFi.status() != WL_CONNECTED) return;

  logLine("[NTP] Sync start");
  configTime(0, 0, "pool.ntp.org", "time.nist.gov");

  time_t now = time(nullptr);
  uint8_t tries = 0;
  while (now < 1700000000 && tries < 25) {
    delay(250);
    now = time(nullptr);
    tries++;
  }

  if (now >= 1700000000) {
    logLine(String("[NTP] Sync OK epoch=") + String((uint32_t)now));
  } else {
    logLine("[NTP] Not ready, continuing");
  }
}

// =========================
// I2S Mic
// =========================
void initI2S() {
  logLine("[I2S] Initializing INMP441 interface");

  i2s_config_t cfg = {};
  cfg.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX);
  cfg.sample_rate = 16000;
  cfg.bits_per_sample = I2S_BITS_PER_SAMPLE_32BIT;
  cfg.channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT;

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  cfg.communication_format = I2S_COMM_FORMAT_STAND_I2S;
#else
  cfg.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_I2S | I2S_COMM_FORMAT_I2S_MSB);
#endif

  cfg.intr_alloc_flags = ESP_INTR_FLAG_LEVEL1;
  cfg.dma_buf_count = 8;
  cfg.dma_buf_len = 256;
  cfg.use_apll = false;
  cfg.tx_desc_auto_clear = false;
  cfg.fixed_mclk = 0;

  i2s_pin_config_t pin = {};
  pin.mck_io_num = I2S_PIN_NO_CHANGE;
  pin.bck_io_num = I2S_SCK;
  pin.ws_io_num = I2S_WS;
  pin.data_out_num = I2S_PIN_NO_CHANGE;
  pin.data_in_num = I2S_SD;

  esp_err_t e = i2s_driver_install(I2S_PORT, &cfg, 0, NULL);
  if (e != ESP_OK) {
    logLine(String("[I2S] driver install error=") + String((int)e));
    return;
  }

  e = i2s_set_pin(I2S_PORT, &pin);
  if (e != ESP_OK) {
    logLine(String("[I2S] set pin error=") + String((int)e));
    return;
  }

  i2s_zero_dma_buffer(I2S_PORT);
  activeMicChannel = -1;
  activeMicDecode = -1;
  micSilentStreak = 0;
  logLine("[I2S] Ready");
}

float mapDbToScore(float dbfs) {
  float normalized = (dbfs - MIC_DB_MIN) / (MIC_DB_MAX - MIC_DB_MIN);
  if (normalized < 0.0f) normalized = 0.0f;
  if (normalized > 1.0f) normalized = 1.0f;
  return normalized * 100.0f;
}

int32_t signExtend24(uint32_t v) {
  if (v & 0x00800000UL) {
    v |= 0xFF000000UL;
  }
  return (int32_t)v;
}

void readMicMetrics(float& micRaw, float& micRms, float& micPeak) {
  const int N = 256;
  static int32_t buffer[N];
  size_t bytesRead = 0;

  esp_err_t rc = i2s_read(I2S_PORT, (void*)buffer, sizeof(buffer), &bytesRead, 20 / portTICK_PERIOD_MS);
  if (rc != ESP_OK || bytesRead == 0) {
    micRaw = 0.0f;
    micRms = 0.0f;
    micPeak = 0.0f;
    return;
  }

  int count = bytesRead / sizeof(int32_t);
  if (count <= 0) {
    micRaw = 0.0f;
    micRms = 0.0f;
    micPeak = 0.0f;
    return;
  }

  int frames = count / 2;
  if (frames <= 0) {
    micRaw = 0.0f;
    micRms = 0.0f;
    micPeak = 0.0f;
    return;
  }

  double sumAbs[6] = {0, 0, 0, 0, 0, 0};
  double sumSq[6] = {0, 0, 0, 0, 0, 0};
  double peak[6] = {0, 0, 0, 0, 0, 0};

  for (int i = 0; i < frames; i++) {
    int32_t rawL = buffer[2 * i];
    int32_t rawR = buffer[2 * i + 1];

    double candidates[6] = {
      (double)(rawL >> 8) / 8388608.0,                                  // left, high 24 bits
      (double)(rawR >> 8) / 8388608.0,                                  // right, high 24 bits
      (double)signExtend24((uint32_t)rawL & 0x00FFFFFFUL) / 8388608.0,  // left, low 24 bits
      (double)signExtend24((uint32_t)rawR & 0x00FFFFFFUL) / 8388608.0,  // right, low 24 bits
      (double)rawL / 2147483648.0,                                       // left, full 32-bit
      (double)rawR / 2147483648.0                                        // right, full 32-bit
    };

    for (int j = 0; j < 6; j++) {
      double x = candidates[j];
      double a = fabs(x);
      sumAbs[j] += a;
      sumSq[j] += x * x;
      if (a > peak[j]) peak[j] = a;
    }
  }

  float rmsCandidates[6];
  for (int j = 0; j < 6; j++) {
    rmsCandidates[j] = (float)sqrt(sumSq[j] / (double)frames);
  }

  int bestIdx = 0;
  for (int j = 1; j < 6; j++) {
    if (rmsCandidates[j] > rmsCandidates[bestIdx]) {
      bestIdx = j;
    }
  }

  if (bestIdx != activeMicDecode) {
    activeMicDecode = bestIdx;
    const char* decodeLabel =
      (bestIdx == 0) ? "L_hi24" :
      (bestIdx == 1) ? "R_hi24" :
      (bestIdx == 2) ? "L_lo24" :
      (bestIdx == 3) ? "R_lo24" :
      (bestIdx == 4) ? "L_i32" : "R_i32";
    activeMicChannel = (bestIdx % 2 == 0) ? 0 : 1;
    logLine(String("[I2S] decode -> ") + decodeLabel + " channel=" + (activeMicChannel == 0 ? "LEFT" : "RIGHT"));
  }

  double avgAbsLinear = sumAbs[bestIdx] / (double)frames;
  double rmsLinear = rmsCandidates[bestIdx];
  double peakLinear = peak[bestIdx];

  if (rmsLinear < 1e-9 && peakLinear < 1e-9) {
    micSilentStreak++;
  } else {
    micSilentStreak = 0;
  }

  if (micSilentStreak >= MIC_SILENT_REINIT_AFTER) {
    logLine("[I2S] sustained silence detected, restarting I2S");
    i2s_driver_uninstall(I2S_PORT);
    initI2S();
    micSilentStreak = 0;
  }

  float rawDb = 20.0f * log10f(fmaxf((float)avgAbsLinear, 1e-9f));
  float rmsDb = 20.0f * log10f(fmaxf((float)rmsLinear, 1e-9f));
  float peakDb = 20.0f * log10f(fmaxf((float)peakLinear, 1e-9f));

  micRaw = mapDbToScore(rawDb);
  micRms = mapDbToScore(rmsDb);
  micPeak = mapDbToScore(peakDb);

  if (SERIAL_LOGS) {
    logLine(
      String("[MIC] lin_rms=") + String((float)rmsLinear, 6) +
      " (" + String(rmsDb, 1) + " dBFS)" +
      " score_rms=" + String(micRms, 1) +
      " peak=" + String(micPeak, 1)
    );
  }

  if (micRaw < 0.0f) micRaw = 0.0f;
  if (micRms < 0.0f) micRms = 0.0f;
  if (micPeak < 0.0f) micPeak = 0.0f;
}

// =========================
// Sensor Derivations
// =========================
bool readPresence(float micRaw) {
  if (USE_REAL_LD2410_OUT) {
    return digitalRead(LD2410_OUT_PIN) == HIGH;
  }
  return micRaw > 8.0f;
}

float estimateMovement(bool presence, float micPeak) {
  if (!presence) return 0.0f;
  float movement = micPeak * 0.8f;
  if (movement > 100.0f) movement = 100.0f;
  return movement;
}

float estimateBreathingRate(bool presence, float micRaw) {
  if (!presence) return 0.0f;
  float br = 12.0f + fminf(8.0f, micRaw * 0.1f);
  if (br < 8.0f) br = 8.0f;
  if (br > 24.0f) br = 24.0f;
  return br;
}

// =========================
// HTTP
// =========================
bool postJsonWithRetry(const String& url, const String& body, String& responseOut, int& codeOut, uint8_t maxAttempts) {
  for (uint8_t attempt = 1; attempt <= maxAttempts; attempt++) {
    if (WiFi.status() != WL_CONNECTED) {
      ensureWiFiConnected();
      delay(250);
    }

    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(HTTP_TIMEOUT_MS / 1000);

    HTTPClient http;
    http.setConnectTimeout(HTTP_CONNECT_TIMEOUT_MS);
    http.setTimeout(HTTP_TIMEOUT_MS);
    http.setReuse(false);

    logLine(String("[HTTP] Attempt ") + String(attempt) + "/" + String(maxAttempts));
    logLine(String("[HTTP] POST ") + url);
    logLine(String("[HTTP] Body bytes=") + String(body.length()));

    if (!http.begin(client, url)) {
      codeOut = -1;
      logLine("[HTTP] begin() failed");
    } else {
      http.addHeader("Content-Type", "application/json");
      http.addHeader("Connection", "close");
      int code = http.POST(body);
      codeOut = code;

      if (code > 0) {
        responseOut = http.getString();
      } else {
        logLine(String("[HTTP] POST failed: ") + http.errorToString(code));
      }
      logLine(String("[HTTP] Status=") + String(code));

      if (responseOut.length() > 0) {
        size_t n = responseOut.length();
        if (n > 220) n = 220;
        logLine(String("[HTTP] Resp preview: ") + responseOut.substring(0, n));
      }

      http.end();
      if (code >= 200 && code < 300) {
        return true;
      }
    }

    if (attempt < maxAttempts) {
      delay(700U * attempt);
    }
  }

