CPE3B-ersando-aarongabriel/AgapAI-Backend/docs/esp32_capture_window_firmware.ino
  return false;
}

// =========================
// Session API
// =========================
bool parseSessionId(const String& response, String& sessionIdOut) {
  StaticJsonDocument<768> doc;
  DeserializationError err = deserializeJson(doc, response);
  if (err) {
    logLine(String("[SESSION] parse error: ") + err.c_str());
    return false;
  }

  if (!doc["session_id"].is<const char*>()) {
    logLine("[SESSION] response missing session_id");
    return false;
  }

  sessionIdOut = String((const char*)doc["session_id"]);
  return sessionIdOut.length() > 0;
}

bool startSession() {
  if (WiFi.status() != WL_CONNECTED) {
    logLine("[SESSION] start aborted: wifi down");
    return false;
  }

  StaticJsonDocument<512> req;
  req["device_id"] = DEVICE_ID;
  req["firmware_version"] = FW_VERSION;
  JsonObject metadata = req.createNestedObject("metadata");
  metadata["source"] = "esp32";
  metadata["mode"] = USE_REAL_LD2410_OUT ? "ld2410_out" : "dummy_presence";
  metadata["transport"] = "wifi";

  String body;
  serializeJson(req, body);
  logLine(String("[SESSION] Start payload: ") + body);

  String response;
  int code = 0;
  bool ok = postJsonWithRetry(endpointStart(), body, response, code, 3);
  if (!ok) {
    logLine(String("[SESSION] start failed code=") + String(code));
    drawOled("Start failed", String("HTTP ") + String(code));
    return false;
  }

  String sid;
  if (!parseSessionId(response, sid)) {
    drawOled("Start parse fail");
    return false;
  }

  currentSessionId = sid;
  logLine(String("[SESSION] started sid=") + currentSessionId);
  drawOled("Session started", currentSessionId);
  return true;
}

bool sendChunk(const SensorSample& s) {
  if (currentSessionId.length() == 0) return false;

  StaticJsonDocument<1024> req;
  req["session_id"] = currentSessionId;
  req["chunk_id"] = String(DEVICE_ID) + "-" + String((unsigned long)(s.epoch_ms & 0xFFFFFFFFUL), HEX);

  JsonArray samples = req.createNestedArray("samples");
  JsonObject row = samples.createNestedObject();
  row["recorded_at"] = iso8601FromEpochMs(s.epoch_ms);
  row["mic_raw"] = s.mic_raw;
  row["mic_rms"] = s.mic_rms;
  row["mic_peak"] = s.mic_peak;
  row["temperature"] = s.temperature;
  row["humidity"] = s.humidity;
  row["breathing_rate"] = s.breathing_rate;
  row["movement_level"] = s.movement_level;
  row["presence_detected"] = s.presence_detected;

  String body;
  serializeJson(req, body);

  String response;
  int code = 0;
  bool ok = postJsonWithRetry(endpointChunk(), body, response, code, 2);
  if (!ok) {
    logLine(String("[CHUNK] send failed code=") + String(code));
    return false;
  }

  return true;
}

bool enqueuePending(const SensorSample& s) {
  if (pendingCount >= PENDING_QUEUE_CAPACITY) {
    // Drop oldest and keep newest to preserve recent continuity.
    for (uint8_t i = 1; i < pendingCount; i++) {
      pendingQueue[i - 1] = pendingQueue[i];
    }
    pendingQueue[pendingCount - 1] = s;
    logLine("[CHUNK] pending queue full, dropped oldest sample");
    return false;
  }

  pendingQueue[pendingCount] = s;
  pendingCount++;
  logLine(String("[CHUNK] queued pending count=") + String(pendingCount));
  return true;
}

bool flushOnePendingSample() {
  if (pendingCount == 0) return true;
  if (WiFi.status() != WL_CONNECTED) return false;

  if (!sendChunk(pendingQueue[0])) {
    return false;
  }

  for (uint8_t i = 1; i < pendingCount; i++) {
    pendingQueue[i - 1] = pendingQueue[i];
  }
  pendingCount--;
  logLine(String("[CHUNK] flushed one pending, left=") + String(pendingCount));
  return true;
}

void flushPendingWithBudget(uint32_t budgetMs) {
  uint32_t start = millis();
  while (pendingCount > 0 && (millis() - start) < budgetMs) {
    if (!flushOnePendingSample()) {
      delay(80);
      ensureWiFiConnected();
      continue;
    }
    delay(25);
  }
}

bool endSession() {
  if (currentSessionId.length() == 0) {
    return false;
  }

  if (stats.sample_count == 0) {
    logLine("[END] no samples captured");
    return false;
  }

  float avgAmp = (float)(stats.sum_mic_raw / stats.sample_count);
  float rmsAmp = (float)(stats.sum_mic_rms / stats.sample_count);
  float peakIntensity = stats.max_mic_peak;
  int snoreEvents = (int)stats.snore_event_count;
  float snoreScore = fminf(100.0f, avgAmp * 1.4f);
  float avgBreathing = (float)(stats.sum_breathing_rate / stats.sample_count);
  float avgTemp = (float)(stats.sum_temperature / stats.sample_count);
  float avgHum = (float)(stats.sum_humidity / stats.sample_count);

  StaticJsonDocument<1024> req;
  req["session_id"] = currentSessionId;
  req["ended_at"] = iso8601FromEpochMs(nowEpochMs());

  JsonObject summary = req.createNestedObject("summary");
  summary["sample_count"] = stats.sample_count;
  summary["average_amplitude"] = avgAmp;
  summary["rms_amplitude"] = rmsAmp;
  summary["peak_intensity"] = peakIntensity;
  summary["snore_event_count"] = snoreEvents;
  summary["snore_score"] = snoreScore;
  summary["average_breathing_rate"] = avgBreathing;
  summary["average_temperature"] = avgTemp;
  summary["average_humidity"] = avgHum;

  String body;
  serializeJson(req, body);
  logLine(String("[END] payload bytes=") + String(body.length()));

  String response;
  int code = 0;
  bool ok = postJsonWithRetry(endpointEnd(), body, response, code, 3);
  if (!ok) {
    logLine(String("[END] failed code=") + String(code));
    return false;
  }

  DynamicJsonDocument res(4096);
  if (deserializeJson(res, response) == DeserializationError::Ok) {
    const char* rec1 = res["recommendations"][0] | "Done";
    const char* patternLabel = res["breathing_pattern"]["label"] | "Breathe";
    int inhale = res["breathing_pattern"]["inhale_seconds"] | 4;
    int hold = res["breathing_pattern"]["hold_seconds"] | 0;
    int exhale = res["breathing_pattern"]["exhale_seconds"] | 6;

    latestRecommendation = String(rec1);
    latestBreathingLine = String(patternLabel) + " " + String(inhale) + "-" + String(hold) + "-" + String(exhale);

    drawOled(
      String("Ended n=") + String(stats.sample_count),
      clipText(String("Rec: ") + latestRecommendation),
      clipText(String("Breath: ") + latestBreathingLine)
    );
  } else {
    latestRecommendation = "Session complete";
    latestBreathingLine = "4-0-6 nasal";
    drawOled("Session ended", String("n=") + String(stats.sample_count), "Resp parse fallback");
  }

