CPE3B-ersando-aarongabriel/AgapAI-Backend/docs/esp32_capture_window_firmware.ino
  return true;
}

// =========================
// Capture Logic
// =========================
void resetStats() {
  stats.sample_count = 0;
  stats.sum_mic_raw = 0.0;
  stats.sum_mic_rms = 0.0;
  stats.max_mic_peak = 0.0f;
  stats.snore_event_count = 0;
  stats.sum_breathing_rate = 0.0;
  stats.sum_temperature = 0.0;
  stats.sum_humidity = 0.0;
  pendingCount = 0;
  lastSampleMs = 0;
  logLine("[CAPTURE] Rolling stats reset");
}

bool collectSample(SensorSample& out) {
  float t = dht.readTemperature();
  float h = dht.readHumidity();
  if (!isnan(t)) {
    lastValidTemp = t;
  } else {
    t = lastValidTemp;
    if (millis() - lastDhtWarnMs > 6000) {
      lastDhtWarnMs = millis();
      logLine("[DHT] Temperature read failed; using last valid value");
    }
  }

  if (!isnan(h)) {
    lastValidHum = h;
  } else {
    h = lastValidHum;
    if (millis() - lastDhtWarnMs > 6000) {
      lastDhtWarnMs = millis();
      logLine("[DHT] Humidity read failed; using last valid value");
    }
  }

  float micRaw = 0.0f;
  float micRms = 0.0f;
  float micPeak = 0.0f;
  readMicMetrics(micRaw, micRms, micPeak);

  bool presence = readPresence(micRaw);
  float movement = estimateMovement(presence, micPeak);
  float breathingRate = estimateBreathingRate(presence, micRaw);

  out.epoch_ms = nowEpochMs();
  out.mic_raw = micRaw;
  out.mic_rms = micRms;
  out.mic_peak = micPeak;
  out.temperature = t;
  out.humidity = h;
  out.breathing_rate = breathingRate;
  out.movement_level = movement;
  out.presence_detected = presence;
  return true;
}

void updateStats(const SensorSample& s) {
  stats.sample_count += 1;
  stats.sum_mic_raw += s.mic_raw;
  stats.sum_mic_rms += s.mic_rms;
  if (s.mic_peak > stats.max_mic_peak) stats.max_mic_peak = s.mic_peak;
  if (s.mic_raw >= SNORE_THRESHOLD) stats.snore_event_count += 1;
  stats.sum_breathing_rate += s.breathing_rate;
  stats.sum_temperature += s.temperature;
  stats.sum_humidity += s.humidity;
}

// =========================
// Button / Status
// =========================
bool isButtonPressed() {
  const uint32_t nowMs = millis();
  bool reading = digitalRead(BUTTON_PIN);

  if (reading != buttonLastRawState) {
    buttonLastRawState = reading;
    lastDebounceMs = nowMs;
    logLine(String("[BUTTON] raw changed to ") + (reading == LOW ? "LOW" : "HIGH"));
  }

  if ((nowMs - lastDebounceMs) >= BUTTON_DEBOUNCE_MS) {
    if (reading != buttonStableState) {
      buttonStableState = reading;
      logLine(String("[BUTTON] stable changed to ") + (buttonStableState == LOW ? "LOW" : "HIGH"));
      if (buttonStableState == LOW) {
        logLine("[BUTTON] PRESS event");
        return true;
      }
    }
  }

  if ((nowMs - lastButtonPollLogMs) >= 3000) {
    lastButtonPollLogMs = nowMs;
    logLine(String("[BUTTON] poll raw=") + (reading == LOW ? "LOW" : "HIGH") +
            " stable=" + (buttonStableState == LOW ? "LOW" : "HIGH"));
  }

  return false;
}

void logHeartbeat() {
  const uint32_t nowMs = millis();
  if ((nowMs - lastHeartbeatMs) < HEARTBEAT_MS) return;
  lastHeartbeatMs = nowMs;

  logLine(
    String("[HEARTBEAT] state=") + stateName(currentState) +
    " wifi=" + (WiFi.status() == WL_CONNECTED ? "UP" : "DOWN") +
    " samples=" + String(stats.sample_count) +
    " session=" + (currentSessionId.length() ? "YES" : "NO")
  );
}

// =========================
// Setup / Loop
// =========================
void setup() {
  Serial.begin(115200);
  delay(350);

  logLine("");
  logLine("=== AGAPAI STREAMING BOOT ===");
  logLine(String("[BOOT] FW=") + FW_VERSION + " device=" + DEVICE_ID);

  pinMode(BUTTON_PIN, INPUT_PULLUP);
  pinMode(LD2410_OUT_PIN, INPUT);

  buttonLastRawState = digitalRead(BUTTON_PIN);
  buttonStableState = buttonLastRawState;
  logLine(String("[BOOT] Button initial state=") + (buttonStableState == LOW ? "LOW" : "HIGH"));

  dht.begin();
  logLine("[BOOT] DHT initialized");

  initOled();

  bool wifiOk = connectWiFiBlocking();
  if (!wifiOk) {
    logLine("[BOOT] WiFi not connected yet, retrying in loop");
  }

  syncNtpTime();
  initI2S();
  resetStats();

  drawOled("Ready", "Click1: Start", "Click2: Stop");
  logLine("[BOOT] Setup complete");
}

void loop() {
  ensureWiFiConnected();
  logHeartbeat();

  if (isButtonPressed()) {
    logLine(String("[LOOP] Button press in state=") + stateName(currentState));

    if (currentState == STATE_IDLE || currentState == STATE_ERROR) {
      if (!startSession()) {
        setState(STATE_ERROR);
        drawOled("Start failed", "Press retry");
      } else {
        resetStats();
        setState(STATE_CAPTURING);
        drawOled("Streaming...", "Click2: Stop", "T/H/BR visible");
      }
    } else if (currentState == STATE_CAPTURING) {
      setState(STATE_SUBMITTING);
    } else if (currentState == STATE_RESULT) {
      currentSessionId = "";
      latestRecommendation = "";
      latestBreathingLine = "";
      resetStats();
      setState(STATE_IDLE);
      drawOled("Ready", "Click1: Start", "Click2: Stop");
    }
  }

  if (currentState == STATE_CAPTURING) {
    if (pendingCount > 0) {
      flushOnePendingSample();
    }

    if ((millis() - lastSampleMs) >= SAMPLE_INTERVAL_MS) {
      lastSampleMs = millis();

      SensorSample s;
      if (collectSample(s)) {
        updateStats(s);

        bool sent = sendChunk(s);
        if (!sent) {
          enqueuePending(s);
        }
        logLine(String("[CHUNK] sent=") + (sent ? "1" : "0") + " count=" + String(stats.sample_count));

        drawOled(
          "Streaming...",
          String("n:") + String(stats.sample_count) + " m:" + String(s.mic_raw, 1) + " P:" + (s.presence_detected ? "1" : "0"),
          String("T:") + String(s.temperature, 1) + " H:" + String(s.humidity, 0) + " BR:" + String(s.breathing_rate, 0)
        );
      }
    }
  }

  if (currentState == STATE_SUBMITTING) {
    drawOled("Ending session...", String("n=") + String(stats.sample_count), String("pending=") + String(pendingCount));

    flushPendingWithBudget(12000);
    if (pendingCount > 0) {
      logLine(String("[END] warning unsent pending=") + String(pendingCount));
    }

    bool ok = endSession();
    if (ok) {
      setState(STATE_RESULT);
      drawOled(
        String("Done n=") + String(stats.sample_count),
        clipText(String("Rec: ") + latestRecommendation),
        clipText(String("B: ") + latestBreathingLine)
      );
      logLine("[LOOP] End success -> RESULT");
    } else {
      setState(STATE_ERROR);
      drawOled("End failed", "Press retry");
      logLine("[LOOP] End failed -> ERROR");
    }
  }

  delay(20);
}
